{
  "IssueKinds": [
    {
      "Name": "bug",
      "Text": "This issue describes a bug in the Go implementation.",
      "Details": "",
      "Rules": [
	{
	  "Text": "The issue title must start with a package name followed by a colon.",
	  "Details": "Like \"encoding/json:\" or \"runtime:\""
	},
	{
	  "Text": "The issue should provide a complete, runnable program to reproduce the issue.",
	  "Details": "The program should be written in Go. The program may be provided via a link to the Go playground."
	},
	{
	  "Text": "The \"What did you see happen?\" section should not be empty.",
	  "Regexp": "### What did you see happen\\?\\s*###"
	},
	{
	  "Text": "The \"What did you expect to see?\" section should not be empty.",
	  "Regexp": "### What did you expect to see\\?\\s*###"
	}
      ]
    },
    {
      "Name": "language proposal",
      "Text": "This issue describes a requested change to the Go language specification.",
      "Details": "",
      "Rules": [
	{
	  "Text": "The issue title must start with \"proposal:\"."
	},
	{
	  "Text": "The issue should give examples of using the new language feature. Show how using the new language feature is an improvement on the existing language."
	},
	{
	  "Text": "The issue should indicate whether this change is backwards compatible or not."
	}
      ]
    },
    {
      "Name": "library proposal",
      "Text": "This issue describes a requested change to the Go standard library or x/ libraries.",
      "Details": "",
      "Rules": [
	{
	  "Text": "The issue title must start with \"proposal:\"."
	},
	{
	  "Text": "The title should mention which packages the proposal intends to change."
	},
	{
	  "Text": "The issue should describe the proposed changes to the API, typically by listing the declarations which would implement the new API"
	}
      ]
    },
    {
      "Name": "implementation",
      "Text": "This issue describes a semantics-preserving change to the Go implementation."
    },
    {
      "Name": "access request",
      "Text": "This issue is a request for builder or gomote access."
    },
    {
      "Name": "pkgsite removal request",
      "Text": "This issue is a pkgsite removal request."
    },
    {
      "Name": "automation",
      "Text": "This issue is created by gopherbot or watchflakes automation."
    },
    {
      "Name": "backport",
      "Text": "This issue is created for requesting a backport of a change to a previous Go version."
    },
    {
      "Name": "builders",
      "Text": "This issue is about the running of the Go builders."
    },
    {
      "Name": "question",
      "Text": "This issue is a question about using Go.",
      "Rules": [
	{
	  "Text": "This issue appears to be more of a question than a bug report. Unlike many projects, the Go project does not use GitHub Issues for general discussion or asking questions. GitHub Issues are used for tracking bugs and proposals only. For questions please refer to [our Questions page](https://go.dev/wiki/Questions).",
	  "Description":"This rule should never be satisfied."
	}
      ]
    },
    {
      "Name": "invalid",
      "Text": "This issue is empty, incomplete, or spam."
    },
    {
      "Name": "other",
      "Text": "None of the above."
    }
  ]
}
